#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan for Prod Deployment</summary>

```

terraform
aws_iam_role.s3_audit_role: Refreshing state... [id=prd-s3-audit-role]
aws_api_gateway_rest_api.utils: Refreshing state... [id=6ummp33o18]
aws_s3_bucket.s3_audit_service_bucket: Refreshing state... [id=prd-s3-audit-service-deployment]
aws_iam_role_policy_attachment.s3_audit_lambda: Refreshing state... [id=prd-s3-audit-role/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_lambda_function.s3_audit_lambda: Refreshing state... [id=prd-s3-audit]
module.api_s3_audit_post.aws_api_gateway_resource.root: Refreshing state... [id=d7qrq7]
module.api_s3_audit_post.aws_api_gateway_method.proxy: Refreshing state... [id=agm-6ummp33o18-d7qrq7-POST]
module.api_s3_audit_post.aws_api_gateway_method_response.proxy: Refreshing state... [id=agmr-6ummp33o18-d7qrq7-POST-200]
aws_lambda_alias.s3_audit_alias: Refreshing state... [id=arn:aws:lambda:eu-west-1:428452171461:function:prd-s3-audit:main]
aws_lambda_permission.s3_audit_api_gateway: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_s3_audit_post.aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-6ummp33o18-d7qrq7-POST]
module.api_s3_audit_post.aws_api_gateway_deployment.deployment: Refreshing state... [id=yep7lr]
module.api_s3_audit_post.aws_api_gateway_integration_response.proxy: Refreshing state... [id=agir-6ummp33o18-d7qrq7-POST-200]
module.api_s3_audit_post.aws_api_gateway_stage.deployment: Refreshing state... [id=ags-6ummp33o18-prd]
aws_s3_bucket_versioning.s3_audit_service_bucket_versioning: Refreshing state... [id=prd-s3-audit-service-deployment]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_dynamodb_table.s3_audit_table will be created
  + resource "aws_dynamodb_table" "s3_audit_table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "BucketName"
      + id               = (known after apply)
      + name             = "prd_s3_audit_table"
      + read_capacity    = 1
      + region           = "eu-west-1"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 1

      + attribute {
          + name = "BucketName"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # aws_iam_policy.s3_audit_policy will be created
  + resource "aws_iam_policy" "s3_audit_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for Lambda to audit S3 buckets and write to DynamoDB"
      + id               = (known after apply)
      + name             = "prd-s3-audit-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_s3_checker_attachment will be created
  + resource "aws_iam_role_policy_attachment" "lambda_s3_checker_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "prd-s3-audit-role"
    }

  # aws_lambda_function.s3_audit_lambda will be updated in-place
  ~ resource "aws_lambda_function" "s3_audit_lambda" {
        id                             = "prd-s3-audit"
      ~ qualified_arn                  = "arn:aws:lambda:eu-west-1:428452171461:function:prd-s3-audit:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-1:428452171461:function:prd-s3-audit:2/invocations" -> (known after apply)
        tags                           = {}
      ~ timeout                        = 3 -> 5
      ~ version                        = "2" -> (known after apply)
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_TABLE_NAME" = "prd_s3_audit_table"
                # (1 unchanged element hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @rgrhodesdev, Action: `pull_request`*